Templates/external_disc_rotatingwall_steady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Parameterized: Initialize to freestream velocity
internalField   uniform ({{ ux }} 0 {{ uz }});

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ({{ ux }} 0 {{ uz }});
    }

    outlet
    {
        type            zeroGradient;
    }

    tunnel
    {
        type            slip;
    }

    disc
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           constant {{ omega_rotation }};
    }
}

// ************************************************************************* //
