Templates/external_disc_rotatingwall_steady/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disc.stl
{
    // Constant: Method for identifying sharp edges on the rim/bead
    extractionMethod    extractFromSurface;
    
    // Constant: 150 degrees is standard for capturing disc profiles
    includedAngle       150;
    
    writeObj            yes;
}

// ************************************************************************* //
